# RebarShapeConstraintSegmentLength Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintSegmentLength Members
RebarShapeConstraintSegmentLength Class Constructors Methods Properties See Also
---
The RebarShapeConstraintSegmentLength type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintSegmentLength | Create a segment length constraint. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RebarShapeConstraint.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetParamId | Return the Id of the parameter associated with this constraint.  (Inherited from RebarShapeConstraint.) |
| GetSegmentEndReferenceType | Choice of two possibilities for the start and end references of the length constraint. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RebarShapeConstraint.) |

# See Also
RebarShapeConstraintSegmentLength Class
Autodesk.Revit.DB.Structure Namespace